// swiftguide.cn
// 1.2 Swift 初见

println("你好，世界！")

var 变量 = 42
变量 = 50
let 常量 = 42

let 推断整数 = 70
let 推断双精度数 = 70.0
let 指定双精度数: Double = 70

let 指定浮点数: Float = 80

let 标签 = "宽度是 "
let 宽度 = 94
let 宽度标签 = 标签 + String(宽度)

let 苹果 = 3
let 橘子 = 5
let 苹果总结 = "我有 \(苹果) 个苹果。"
let 水果总结 = "我有 \(苹果 + 橘子) 个水果。"

let 名字 = "小倉唯"
let 招呼 = "你好，\(名字)！\(指定浮点数)"

var 星期 = ["日", "月", "火", "水", "木", "金", "土"]
星期[1] = "一"

var 爱称 = [
    "東山奈央": "闹",
    "水樹奈々": "77",
]
爱称["喜多村英梨"] = "酋长"

let 空数组 = [String]()
let 空字典 = [String: Float]()

星期 = []
爱称 = [:]

let 分数表 = [75, 43, 103, 87, 12]
var 队分数 = 0
for 分数 in 分数表 {
    if 分数 > 50 {
        队分数 += 3
    } else {
        队分数 += 1
    }
}
队分数

var 可选字符串: String? = "こんにちは"
可选字符串 = nil

var 可选名字: String? = "能登麻美子"
var 祝贺 = "你好"
可选名字 = nil
if let 名 = 可选名字 {
    祝贺 = "你好，\(名)"
} else {
    祝贺 = "你好，早見沙織"
}
